app/controllers/power_controller.rb

    def index
        powers = Power.all
---
SELECT "powers".* FROM "powers"

    def show
        powers = Power.find_by(id: params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]